# coding: utf-8
# -*- mode: ruby -*-

tap "homebrew/services"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "mistertea/et"

brew "mas"

brew "mistertea/et/et"
brew "ack"
brew "archey"
brew "asciinema"
brew "asdf"
brew "aspell"
brew "autoconf"
brew "autogen"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "bc"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "container-diff"  # diff on docker containers
brew "coreutils"
brew "cowsay"
brew "ctop"  # top for containers
brew "curl"
brew "d12frosted/emacs-plus/emacs-plus",
     restart_service: true,
     args: ["HEAD",
            # NOTE: fails with --head as of ed03d293a720a2bf72ce732ea48fd07feb0104d1
            # "with-xwidgets",
            "with-dbus",
            "with-modern-icon",
            "without-spacemacs-icon"]
brew "diff-so-fancy"
brew "direnv"
brew "exa"
brew "fd"  # better find
brew "findutils"
brew "fish"
brew "fortune"
brew "fzf"
brew "gcc"
brew "getantibody/tap/antibody"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "graphicsmagick"
brew "grep"
brew "guile"
brew "htop"
brew "httpie"  # curl++ (cli: `http`)
brew "hub"  # github cli
brew "ical-buddy"
brew "icdiff"  # coloured diff
brew "iperf"  # measure network bandwidth
brew "jq"  # json processor
brew "keychain"
brew "lnav"  # curses interface for logs
brew "lolcat"
brew "mkcert"  # install/uninstall dev certificates
brew "moreutils"
brew "mosh"
brew "mtr"  # traceroute + ping
brew "ncdu"  # curses du
brew "ninja"
brew "nmap"  # port scanner
brew "nvim"
brew "openssh"
brew "openssl"
brew "overmind"  # process manager w/ tmux
brew "pidof"  # get PID of proc name
brew "pkg-config"
brew "protobuf"
brew "pstree"
brew "pv"  # stream completion
brew "ranger"
brew "reattach-to-user-namespace"  # tmux + iterm
brew "rename"
brew "ripgrep"  # or `rg`
brew "rtmpdump"  # download RTMP streams
brew "rubberband"  # audio-stretching tools + lib
brew "socat"  # netcat++
brew "spark"  # CLI for sparklines (▁▂▃▅▇)
brew "ssh-copy-id"
brew "sshfs"
brew "teensy_loader_cli"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "xz"  # compression tool
brew "yamllint"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "thefuck"
brew "tldr"


#########
## Cask #
#########

# cask "yabai"  # TODO test this
cask "alfred"
cask "anki"
cask "battle-net"
cask "keepingyouawake"
cask "calibre"
cask "cheatsheet"
cask "cyberduck"  # ftp client
cask "dash"
cask "docker"
cask "dropbox"
cask "eqmac"
cask "firefox"
cask "flux"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "handbrake"  # video converter
cask "keycastr"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "licecap"  # screen -> gif
cask "moom"
cask "obs"
cask "omnigraffle"
cask "osxfuse"
cask "vnc-viewer"
cask "robo-3t"  # mongodb gui
cask "skype"
cask "slack"
cask "sonic-pi"
cask "spotify"
cask "steam"
cask "teensy"
cask "timing"
cask "transmission"
cask "ubersicht"  # widget bar
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "webtorrent"
cask "whatsapp"
cask "xquartz"
cask "zotero"


########
# libs #
########

brew "aom"  # AV1 video streams codec
brew "epsilon"  # wavelet-compression image codec
brew "libsamplerate"  #  audio sample rate converter
brew "theora"  # video format
brew "hdf5"
brew "openblas"
brew "bdw-gc"  # C++ gc
brew "boost"
brew "boost-python"
brew "cfitsio"  # FITS data
brew "expat"  # XML parser
brew "ffmpeg"
brew "flac"
brew "freexl"
brew "imagemagick"
brew "libass"
brew "libbluray"
brew "libdap"
brew "libde265"
brew "libgeotiff"
brew "libheif"
brew "libmpc"
brew "libogg"
brew "libomp"
brew "libpq"
brew "libsndfile"
brew "libsoxr"
brew "libspatialite"
brew "libusb-compat"
brew "libvidstab"
brew "libvorbis"
brew "libvpx"
brew "libxml2"
brew "qt"
brew "frei0r"  # video effects
brew "gdal"  # geospacial data
brew "geos"  # geometry engine
brew "giflib"
brew "gobject-introspection"
brew "ilmbase"  # ILM (image format)
brew "isl"  # integer set library
brew "json-c"  # json C lib
brew "lame"
brew "leptonica"  # image processing
brew "mpfr"  # multiple-precision floating point
brew "mpich"  # MPI message passing
brew "netcdf"  # array lib
brew "nspr"  # mozilla libc-like
brew "nss"  # mozilla secure sockets
brew "opencore-amr"  # android audio codecs
brew "openexr"  # image format
brew "opus"  # audio codec
brew "poppler"  # fork of xpdf-3.0
brew "popt"  # getopt++
brew "proj"  # cartographic projections
brew "python@2"
brew "sdl2"
brew "shapelib"
brew "shared-mime-info"  # common mime types
brew "snappy"  # compression
brew "speex"  # audio codec for speech
brew "swig"  # c/c++ scripting
brew "szip"  # compression
brew "tesseract"  # OCR
brew "unixodbc"  # ODBC 3 api (database)
brew "x264"
brew "x265"
brew "xerces-c"  # XML parsing
brew "xvid"  # MPEG-4
brew "zeromq"
brew "zstd"
brew "gflags"
