tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
brew "ansible"
brew "archey"
brew "asciinema"
brew "autoconf"
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "exa"
brew "findutils"
brew "fish"
brew "fzf"
brew "font-hack-nerd-font"
brew "fortune"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "htop"
brew "ical-buddy"
brew "iperf"
brew "lolcat"
brew "mas"
brew "MisterTea/et/et"
brew "moreutils"
brew "mosh"
brew "ncdu"
brew "nmap"
brew "openssh"
brew "pv"
brew "ranger"
brew "reattach-to-user-namespace"
brew "rename"
brew "ssh-copy-id"
brew "teensy_loader_cli"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vifm"
brew "watch"
brew "wget"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-modern-icon"]
brew "getantibody/tap/antibody"
cask "alfred"
cask "anki"
cask "battle-net"
cask "caffeine"
cask "cheatsheet"
cask "cyberduck"
cask "dash"
cask "docker"
cask "firefox"
# cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "licecap"
cask "mountain-duck"
cask "obs"
cask "omnigraffle"
cask "shiftit"
cask "skype"
cask "slack"
cask "sonic-pi"
cask "spotify"
cask "steam"
cask "teensy"
cask "transmission"
cask "vagrant"
cask "vlc"
cask "zotero"
cask "caskroom/fonts/font-source-code-pro"
